---
type: InstanceVoidCutUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# InstanceVoidCutUtils

`Autodesk.Revit.DB.InstanceVoidCutUtils` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddInstanceVoidCut | 2011 | `public static void AddInstanceVoidCut ( Document document , Element element , Element cuttingInstance )` |
| Method | CanBeCutWithVoid | 2011 | `public static bool CanBeCutWithVoid ( Element element )` |
| Method | GetCuttingVoidInstances | 2011 | `public static ICollection < ElementId > GetCuttingVoidInstances ( Element element )` |
| Method | GetElementsBeingCut | 2011 | `public static ICollection < ElementId > GetElementsBeingCut ( Element cuttingInstance )` |
| Method | InstanceVoidCutExists | 2011 | `public static bool InstanceVoidCutExists ( Element element , Element cuttingInstance )` |
| Method | IsVoidInstanceCuttingElement | 2011 | `public static bool IsVoidInstanceCuttingElement ( Element element )` |
| Method | RemoveInstanceVoidCut | 2011 | `public static void RemoveInstanceVoidCut ( Document document , Element element , Element cuttingInstance )` |